cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jesseduffield/lazydocker"
tap "neovim/neovim"
tap "universal-ctags/universal-ctags"
tap "kyoshidajp/ghkw"
tap "wagoodman/dive"

brew "anyenv"
brew "bat"
brew "diff-so-fancy"
brew "dive"
brew "fd"
brew "fzf"
brew "ghq"
brew "git"
brew "git-lfs"
brew "git-secrets"
brew "gitui"
brew "glow"
brew "go"
brew "graphviz"
brew "gron"
brew "hub"
brew "httpie"
brew "jq"
brew "lf"
brew "mdcat"
brew "neovim"
brew "python"
brew "python@2"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rlwrap"
brew "shpotify"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh", args: ["without-etcdir"]
brew "lazydocker"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "ghkw"
brew "zoxide"

# Apps
cask 'alfred'
cask 'android-file-transfer'
cask 'google-backup-and-sync'
cask 'cheatsheet'
cask 'clipy'
cask 'docker'
cask 'figma'
cask "font-hackgen"
cask "font-hackgen-nerd"
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'jasper'
cask 'karabiner-elements'
cask 'kindle'
cask 'licecap'
cask 'monitorcontrol'
cask 'ngrok'
cask 'obsidian'
cask 'sequel-pro'
cask 'shiftit'
cask 'slack'
cask 'spotify'
cask 'typora'
cask 'visual-studio-code'
cask 'vivaldi'

mas 'Amphetamin', id: 937984704
mas 'Day One', id: 1055511498
mas 'Habitify', id: 1111447047
mas 'Hidden Bar', id: 1452453066
mas 'Todoist', id: 585829637
mas 'Tomato 2', id: 1494210770
mas 'Twitter', id: 1482454543
