cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jesseduffield/lazydocker"
tap "neovim/neovim"
tap "wagoodman/dive"

brew "anyenv"
brew "bat"
brew "diff-so-fancy"
brew "dive"
brew "fd"
brew "fzf"
brew "ghq"
brew "git"
brew "git-lfs"
brew "git-secrets"
brew "gitui"
brew "glow"
brew "go"
brew "graphviz"
brew "gron"
brew "hub"
brew "httpie"
brew "jq"
brew "lf"
brew "mdcat"
brew "neovim"
brew "python"
# brew "python@2"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rlwrap"
brew "shpotify"
brew "tailspin"
brew "tmux"
brew "tree"
brew "vim"
# brew "zsh", args: ["without-etcdir"]
brew "lazydocker"
brew "universal-ctags"
brew "zoxide"

# Apps
cask '1password'
cask 'alfred'
cask 'android-file-transfer'
cask 'anki'
# cask 'google-backup-and-sync'
# cask 'cheatsheet'
cask 'clipy'
cask 'docker'
cask 'deepl'
cask 'figma'
cask "font-hackgen"
cask "font-hackgen-nerd"
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'karabiner-elements'
cask 'licecap'
cask 'monitorcontrol'
cask 'ngrok'
cask 'obsidian'
# cask 'sequel-pro'
cask 'rectangle'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'

mas 'Amphetamin', id: 937984704
# mas 'Day One', id: 1055511498
mas 'Evernote', id: 406056744
mas 'Habitify', id: 1111447047
mas 'Hidden Bar', id: 1452453066
mas 'Kindle', id: 302584613
mas 'Slack', id: 803453959
mas 'Todoist', id: 585829637
mas 'Tomato 2', id: 1494210770
# mas 'Twitter', id: 1482454543
mas 'X', id: 333903271
mas 'Toggl Track', id: 1291898086
mas '辞書 by 物書堂', id: 1380563956
